import * as yup from "yup";

export const UserValidation = {
	login: yup.object({
		email: yup
			.string()
			.email("Некоректна пошта")
			.required("Це поле обов'язкове")
			.trim("Видаліть пробіли на початку і в кінці"),
		password: yup
			.string()
			.required("Це поле обов'язкове")
			.trim("Видаліть пробіли на початку і в кінці")
	}),
    register: yup.object({
        email: yup
            .string()
            .email("Некоректна пошта")
            .required("Це поле обов'язкове")
            .min(3, "Довжина повинна бути 3 або більше")
            .max(64, "Довжина повинна бути менше або 32")
            .trim("Видаліть пробіли на початку і в кінці"),
        password: yup
            .string()
            .required("Це поле обов'язкове")
            .min(8, "Довжина повинна бути 8 або більше")
            .max(32, "Довжина повинна бути менше або 32")
            .trim("Видаліть пробіли на початку і в кінці")
            .test("uppercase", "Має бути хоча б одна велика літера", (v) =>
                /[A-Z]/.test(v || "")
            )
            .test("lowercase", "Має бути хоча б одна маленька літера", (v) =>
                /[a-z]/.test(v || "")
            )
            .test("digit", "Має бути хоча б одна цифра", (v) =>
                /\d/.test(v || "")
            )
            .test("special", "Має бути хоча б один спеціальний символ", (v) =>
                /[!@#$%^&*(),.?":{}|<>]/.test(v || "")
            ),
    })
};
